---
kind: method
id: M:Autodesk.Revit.DB.RepeaterCoordinates.#ctor
source: html/da2df02e-d06c-1bc4-1528-cd0a6055de39.htm
---
# Autodesk.Revit.DB.RepeaterCoordinates.#ctor Method

Creates zero dimensional coordinates.

## Syntax (C#)
```csharp
public RepeaterCoordinates()
```